Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG00-S1/svd/PIC32CK2051SG00064S1.svd
         </registers>
      </peripheral>
      <peripheral>
         <name>MAILBOX</name>
         <description>eSecure MailBox Module</description>
         <groupName>MAILBOX</groupName>
         <prependToName>MAILBOX_</prependToName>
         <baseAddress>0x50000000</baseAddress>
         <addressBlock>
            <offset>0</offset>
            <size>0x5C</size>
            <usage>registers</usage>
         </addressBlock>
         <registers>
            <register>
               <dim>16</dim>
               <dimIncrement>4</dimIncrement>
               <name>FIFO[%s]</name>
               <description>Mailbox FIFO</description>
               <addressOffset>0x0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>Data</name>
                     <description>Mailbox data</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>32</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TX_STATUS</name>
               <description>Transmit Status</description>
               <addressOffset>0x40</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TXREMAINING</name>
                     <description>Transmit Bytes Remaining</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>TXTYPE</name>
                     <description>Message Type</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>TXINT</name>
                     <description>Transmit Interrupt</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXFULL</name>
                     <description>Transmit FIFO Full</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TXERROR</name>
                     <description>Transmit Error</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RX_STATUS</name>
               <description>Receive Status</description>
               <addressOffset>0x44</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>RXREMAINING</name>
                     <description>Receive Bytes Remaining</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>RXTYPE</name>
                     <description>Receive Message Type</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>RXINT</name>
                     <description>Receive Interrupt Occurred</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXEMPTY</name>
                     <description>Receive FIFO Empty</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXHEADER</name>
                     <description>Receive Header</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RXERROR</name>
                     <description>Receive Error</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TX_PROT</name>
               <description>Transmit Protect</description>
               <addressOffset>0x48</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>UNPROT</name>
                     <description>Mailbox Message Unprotected</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRIV</name>
                     <description>Mailbox message Privilaged</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NSEC</name>
                     <description>Mailbox Message Unsecured</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER</name>
                     <description>User bits</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RX_PROT</name>
               <description>Receieve Protect</description>
               <addressOffset>0x4C</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>UNPROTECT</name>
                     <description>Mailbox Message Unprotected</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRIV</name>
                     <description>Mailbox message Privilaged</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NSEC</name>
                     <description>Mailbox Message Unsecured</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER</name>
                     <description>User bits</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TX_HEADER</name>
               <description>Transmit Header</description>
               <addressOffset>0x50</addressOffset>
               <size>32</size>
               <access>write-only</access>
               <fields>
                  <field>
                     <name>MSGSIZE</name>
                     <description>Message Size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>MSGINFO</name>
                     <description>Message Info</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>UNPROT</name>
                     <description>Unprotected Access</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>PRIV</name>
                     <description>Privilaged Access</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>NSEC</name>
                     <description>Non Secure Access</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>USER</name>
                     <description>User Bits</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>8</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>RX_HEADER</name>
               <description>Receive Header</description>
               <addressOffset>0x54</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>MSGSIZE</name>
                     <description>Message Size</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
                  <field>
                     <name>MSGINFO</name>
                     <description>Message Information</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>4</bitWidth>
                  </field>
                  <field>
                     <name>UNPROT</name>
                     <description>Unprotected Access</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>CONFIG</name>
               <description>Configuration</description>
               <addressOffset>0x58</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>TX_INT_ENABLE</name>
                     <description>Transmit Interrupt Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>RX_INT_ENABLE</name>
                     <description>Receive Interrupt Enable</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
